Revit 2026 API

# RoofComponents Properties

---

The RoofComponents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ScaledDepth | The depth of the roof slab. |

#### Reference

RoofComponents Class

Autodesk.Revit.DB.IFC Namespace